nikphillydev/NP1_DRONE/software/STM32/Electronic Speed Controller/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "cmsis_os.h"

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

extern osMessageQueueId_t threadInputQueueHandle;

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED1_Pin GPIO_PIN_13
#define LED1_GPIO_Port GPIOC
#define LED2_Pin GPIO_PIN_14
#define LED2_GPIO_Port GPIOC
#define LED3_Pin GPIO_PIN_15
#define LED3_GPIO_Port GPIOC
#define PHA_FILT_Pin GPIO_PIN_1
#define PHA_FILT_GPIO_Port GPIOA
#define TEMP_Pin GPIO_PIN_2
#define TEMP_GPIO_Port GPIOA
#define PH_VNA_Pin GPIO_PIN_4
#define PH_VNA_GPIO_Port GPIOA
#define PH_VNB_Pin GPIO_PIN_5
#define PH_VNB_GPIO_Port GPIOA
#define PHB_FILT_Pin GPIO_PIN_7
#define PHB_FILT_GPIO_Port GPIOA
#define PHC_FILT_Pin GPIO_PIN_0
#define PHC_FILT_GPIO_Port GPIOB
#define PH_VNC_Pin GPIO_PIN_2
#define PH_VNC_GPIO_Port GPIOB
#define PHA_L_Pin GPIO_PIN_13
#define PHA_L_GPIO_Port GPIOB
#define PHB_L_Pin GPIO_PIN_14
#define PHB_L_GPIO_Port GPIOB
#define PHC_L_Pin GPIO_PIN_15
#define PHC_L_GPIO_Port GPIOB
#define PHA_H_Pin GPIO_PIN_8
#define PHA_H_GPIO_Port GPIOA
#define PHB_H_Pin GPIO_PIN_9
#define PHB_H_GPIO_Port GPIOA
#define PHC_H_Pin GPIO_PIN_10
#define PHC_H_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
